---
type: BrowserOrganization
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# BrowserOrganization

`Autodesk.Revit.DB.BrowserOrganization` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AreFiltersSatisfied | 2015 | `public bool AreFiltersSatisfied ( ElementId elementId )` |
| Method | GetCurrentBrowserOrganizationForSchedules | 2018.1 | `public static BrowserOrganization GetCurrentBrowserOrganizationForSchedules ( Document document )` |
| Method | GetCurrentBrowserOrganizationForSheets | 2015 | `public static BrowserOrganization GetCurrentBrowserOrganizationForSheets ( Document document )` |
| Method | GetCurrentBrowserOrganizationForViews | 2015 | `public static BrowserOrganization GetCurrentBrowserOrganizationForViews ( Document document )` |
| Method | GetFolderItems | 2015 | `public IList < FolderItemInfo > GetFolderItems ( ElementId elementId )` |
| Property | Parameter | — | `` |
| Property | SortingOrder | 2015 | `public SortingOrder SortingOrder { get ; }` |
| Property | SortingParameterId | 2015 | `public ElementId SortingParameterId { get ; }` |
| Property | Type | 2023 | `public BrowserOrganizationType Type { get ; }` |